import React, { useState } from "react";

const poems = [
  {
    title: "اعجاز",
    content: `ندایی در درونِ من طنین انداز می گردد
    که عمقِ این سقوط آغازِ یک پرواز می گردد
    
    گَرَت رنجی ست ای دل زین همه تاریکی و سردی
    صبوری کن که صُبحی تازه تر آغاز می گردد
    
    از این سوزندگی ها پخته گی حاصل شود ای دل
    شگفتا کین سکوتِ تلخ، رسا آواز می گردد
    
    دلت را مثل دریا کن، بزرگ و آبی و آرام 
    در اوجِ نا امیدی ها، عیان اعجاز می گردد
    
    درین آشفته بازارِ جهان، این مژده ما را بس
    که عمق این سقوط آغازِ یک پرواز می گرد`,
  },

  {
    title: "می خوانَد مرا",
    content: `عالَمی دور از زَر و این زور می خوانَد مرا
از دلِ کون و مکان بیرون می خوانَد مرا 

اندرین غربت سرا ماندن نمی جوید دلم
پرده ها را می دَرانم، نور می خوانَد مرا

از خودم بیگانه ام، دل بیقراری می کند . . .
از فراسویِ جهان یک شور می خوانَد مرا

از فراقِ جانِ جانان، ناله‌ی نِی سر دهم 
وان نیستان از قریب و دور می خوانَد مرا

رب من گفتا: تو را من خلق کردم فِی کَبَد
بهرِ درمانِ همین ناسور می خوانَد مرا

من ‌نمی مانم اسیرِ مشتِ خاکی مختصر
خالقم با لطف و عشق و نور می خوانَد مرا
    `,
  },

  {
    title: "حالِ دل",
    content: `آسمانِ دلِ من را بنگر! بارانی ست 
جّوِ احوالِ دلم، بارِ دگر طوفانی ست 

ای دل از عشقِ به فانی گریزان باش، چون
روحِ این خَلق میانِ تنِ شان ‌زندانی ست

دل به باقی بسپار ای دل دریا صفتم!
دل سپردن به فنا، موجبِ پریشانی ست

دل قوی دار و نگاهت به خدا باشد و بس!
انتظار از دگران، والله که‌ نادانی‌ ست

تن به زنجیر مده، جای ‌تو‌ آن عرشِ خداست!
این‌ زمین‌ گیر شدن، عاقبتش ویرانی ست

مهربان باش و دلت را به خدا وصل‌ نما!
که جانِ زنده دلان زنده به مهری جانی ست
    `,
  },
  {
    title: "غزلِ شوریدگی و شور",
    content: `نکه اسرار نهان بر او هویدا می شود
جانِ او با گوهر معنا چه زیبا می شود

این سَری که پُر ز سودایِ جهانِ مادی ست
گر یقین حاصل شود، خالی ز سودا میشود

کِی بگنجد نور و تاریکی، اندر یک محیط ؟
در دلی که شور باشد، عشق پیدا می شود 

سردیِ این روزگار چون گرمی اش ناماندنی ست
تو صبوری پیشه کن! دردت مداوا می شود

جان اگر در شعله ی رنج ست و میسوزد، بساز!
نان چو در تندورِ آتش شد، مهیا می شود

خالقت شاهد بر احوال دلت باشد، بس است!
بعد ازین شوریده حالی، شور بر پا میشود
    `,
  },
  {
    title: "صلح درون",
    content: `چه خوش ست حالِ دل را به خدا سپرده باشیم
در دلِ خزان دنیا، ز درون شگفته باشیم 

ز شرارِ رنج و محنت، نبریم دگر شکایت
وز حرارتش ز خامی بِرَمیم و پخته باشیم

ز فلانی و فلان حرف و فلان سال نجوشیم
و به آبِ مهر و بخشش، دل خویش شسته باشیم

نشود دو روزِ هستی برسد به آخر و لیک 
سخن از عشق به معشوقِ جهان نگفته باشیم

همه عمر به خواب غفلت سپری شد و مبادا
که دو روزِ پیشِ رو را چو جَماد خفته باشیم
    `,
  },

  {
    title: "حمد دل و دلدار",
    content: `دلم ز شوقِ وصالِ تو تپیدن دارد
خوشا به گوشِ دلی کز تو شنیدن دارد

تو خالقِ احدی، لا اله الا تو
منی که عزت خویش از تو دمیدن دارد

من آن فریفته‌ی طعمِ سیبِ ممنوعم
تو آن که چاره درِ توبه گشودن دارد

اگر دلم ز زمین و زمینیان بِشِکَست
چه غم چو کشتیِ امنِ تو رسیدن دارد

میانِ آتشِ دنیا دلم قرار گرفت
ز امیدی که به گلزارِ تو دیدن دارد

دل ار به حسنِ زلیخا دهم، اسیر شود
ز دامِ او به یقینِ تو دویدن دارد

ز ظلمِ خویش اگر در دلِ ظُلَم اُفتد
به اذنِ نورِ هُدایِ تو رهیدن دارد

دل ار به شمسِ قلندر مرید و مایل شد
ز رهِ او غرضِ بر تو رسیدن دارد

سری که نزدِ کسی خم نمی شود ابدا
در آستانِ تو شورِ سر نهیدن دارد
    `,
  },

  {
    title: "مستِ‌ خدا",
    content: `لبریز تر از آنم، کز رنگِ قلم ریزم...
 دلداده تر از آنم، کز پایِ دَرَت خیزم...

در سوز و گدازم من، با دل شود این غم لمس ...
مثل دلِ مولانا، در داغِ فراقِ شمس!

در خود چو سفر کردم، اسرارِ تو پیدا تر
جانَم ز تو معنا تر، عمرم ز تو پویا تر

سر مستم و دیوانه، نی عاقل و فرزانه!
من‌ مستِ توام‌ جانا، من را چه به میخانه؟!

جان شد به تو وابسته، از بَند شده وارسته
می چرخم و می چرخم، آهسته و‌ پیوسته 

این عمر که کافی نیست، صد باره اگر رویَم،
من ‌نامِ تو را خوانم، من راهِ تو می جویم...`,
  },
];

export default function Poems() {
  const [expandedIndex, setExpandedIndex] = useState(null);

  const togglePoem = (index) => {
    if (expandedIndex === index) {
      setExpandedIndex(null);
    } else {
      setExpandedIndex(index);
    }
  };

  return (
    <section className="min-h-screen py-24 px-6 md:px-12 flex flex-col items-center gap-14">
      <div className="two alt-two">
        <h1 className="text-4xl">
          اشعار برگزیده
          <span></span>
        </h1>
      </div>

      <div className="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-2 gap-12 w-full max-w-7xl">
        {poems.map((poem, index) => {
          const isExpanded = expandedIndex === index;
          const poemContent = isExpanded
            ? poem.content
            : poem.content.split("\n").slice(0, 5).join("\n");

          return (
            <div
              key={index}
              className="colored_border rounded-2xl shadow-lg p-6 border-2 border-in00 hover:shadow-xl colored_border"
            >
              <h2 className="text-2xl font-semibold text-indigo-700 mb-4 hover:text-indigo-900 transition-colors">
                {poem.title}
              </h2>
              <p className="text-gray-700 text-lg font-medium whitespace-pre-line leading-relaxed text-right mb-6">
                {poemContent}
              </p>
              <button
                onClick={() => togglePoem(index)}
                className="text-indigo-600 hover:text-indigo-800 font-bold mt-4 transition-colors"
              >
                {isExpanded ? "مشاهده کمتر" : "مشاهده بیشتر"}
              </button>
            </div>
          );
        })}
      </div>
    </section>
  );
}
